chore: update README to use a mermaid diagram
